app/controllers/admin/end_users_controller.rb

SELECT "end_users".* FROM "end_users"
---
	def index
		@end_users = EndUser.all

SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@end_user = EndUser.find(params[:id])

SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@end_user = EndUser.find(params[:id])

SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "end_users" SET "family_name_kana" = ?, "first_name_kana" = ?, "is_unsubscribed" = ?, "updated_at" = ? WHERE "end_users"."id" = ?  [["family_name_kana", ""], ["first_name_kana", ""], ["is_unsubscribed", 0], ["updated_at", "2020-03-23 09:03:05.148724"], ["id", 1]]
---
	def update
		@end_user = EndUser.find(params[:id])
  		if @end_user.update(end_user_params)