app/controllers/admin/genres_controller.rb

SELECT "genres".* FROM "genres"
---
	def index
		@genre = Genre.new
		@genres = Genre.all

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2020-03-21 11:00:35.456038"], ["updated_at", "2020-03-21 11:00:35.456038"]]
---
	def create
		@genre = Genre.new(genre_params)
		if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@genre = Genre.find(params[:id])