app/controllers/admin/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE (created_at >='2020-03-23')
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"
---
	def index
		if request.referer&.include?("/admin/top")
			@order = Order.where("created_at >=?", Date.today)
		elsif params[:end_user_id]
      @order = Order.where("end_user_id >=?" ,params[:end_user_id])
    else
      @order = Order.all