app/views/admin/orders/index.html.erb

            <!-- <% sum = 0 %>
            <% order.order_products.each do |order_product| %>
---
SELECT "orders".* FROM "orders" WHERE (created_at >='2020-03-23')