app/views/end_users/shipping_addresses/index.html.erb

SELECT "shipping_addresses".* FROM "shipping_addresses" WHERE "shipping_addresses"."end_user_id" = ?  [["end_user_id", 1]]
---

     <% @end_user.shipping_addresses.each do |address| %>