app/controllers/end_users/cart_products_controller.rb

	def index
		@end_user = EndUser.find(current_end_user.id)
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]