app/controllers/end_users/products_controller.rb

	def top
	   @genres = Genre.all
	   @products = Product.all
---
SELECT "genres".* FROM "genres"
SELECT "products".* FROM "products"

	def index
		@genres = Genre.all
		if params[:id]
		@genre = Genre.find(params[:id])
		@products = @genre.products.all
---
SELECT "genres".* FROM "genres"
SELECT "products".* FROM "products"