app/controllers/end_users/shipping_addresses_controller.rb

SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def index
 	@shipping_address = ShippingAddress.new

 	# currentユーザーが登録した追加配送先のデータの抽出
 	# @shipping_addresses = ShippingAddress.where(end_user_id: current_end_user.id)
 	@end_user = EndUser.find(current_end_user.id)