app/views/end_users/cart_products/index.html.erb

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."end_user_id" = ?  [["end_user_id", 1]]
---
			<% sum = 0 %>
			<% @end_user.cart_products.each do |cart_product|%>