app/views/admin/products/new.html.erb

		        	<th>ジャンル</th>
		        	<td><%= f.collection_select :genre_id, Genre.all, :id, :name %></td>
---
SELECT "genres".* FROM "genres"