app/views/end_users/products/index.html.erb

SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"
---
				<h1><%= @genre.name %>一覧</h1>
				<h2>全<%= @genre.products.count %> 件</h2>

					<% @genre.products.each do |product| %>